Repository: marcoroth/mirrOS_twitch
Catalog: locale/*/LC_MESSAGES/twitch.po
Languages: de_de, ja_jp

# twitch_description
source: This module shows you the active Livestreams on Twitch
de_de: Zeigt Livestreams die gerade live auf Twitch sind
ja_jp: このモジュールは、現在ライブストリーミング中のものを表示します。

source: Twitch Client ID
ja_jp: Twitch ID

source: Twitch Access Token
ja_jp: Twitch アクセストークン

# twitch_step2_title
source: Frontend options
de_de: Darstellungs-Optionen
ja_jp: フロントエンドオプション

# twitch_include_game
source: show game played on stream?
de_de: Zeige den Spielnamen an?
ja_jp: ストリームでプレイされたゲームを表示しますか？

# twitch_include_title
source: show stream title?
de_de: Zeige den Stream-Titel an?
ja_jp: ストリームタイトルを表示しますか？

# twitch_include_user_icon
source: show user icon next to the viewer count?
de_de: Zeige das User-Icon neben der Zuschaueranzahl an?
ja_jp: 視聴者数の横にユーザーアイコンを表示しますか？

# twitch_include_profil_pic
source: show profile picture?
de_de: Zeige das Profilbild des Streamers an?
ja_jp: プロフィール写真を表示しますか？

# twitch_include_viewer_count
source: show viewer count?
de_de: Zeige die aktuelle Zuschaueranzahl an?
ja_jp: 視聴者数を表示しますか？

# twitch_stream_name_length
source: max. length of stream name (game + title)
de_de: max. Länge des Stream-Namen (Spiel + Titel)
ja_jp: max. ストリーム名の長さ（ゲーム+タイトル）

# twitch_step1
source: Step 1: Login to Twitch
de_de: Schritt 1: Bei Twitch anmelden
ja_jp: Step 1: Twitchにログイン

# twitch_step1_desc
source: Log in to Twitch and close the window again after you signed in.
de_de: Logge dich bei Twitch ein und schliesse anschliessend das Fenster wieder
ja_jp: Twitchにログインし、サインインした後にウィンドウをもう一度閉じます。

# twitch_step1_button
source: Login to Twitch
de_de: Bei Twitch anmelden
ja_jp: Twitchにログイン

# twitch_step2
source: Step 2: Create Twitch Application
de_de: Schritt 2: Erstelle eine Twitch-Applikation
ja_jp: Step 2: Twitchアプリケーションを作成する

# twitch_step2_desc
source: You need to create a <code>Twitch-Developer-Application</code>. To create one click the button below and copy-paste the values from above.
de_de: Du musst eine <code>Twitch-Entwickler-Applikation</code> erstellen. Dies machst du, indem du auf den Button unten klickst und die Werte von oben mit copy-paste auf der Seite einfügst.
ja_jp: <code> Twitch-Developer-Application </ code>を作成する必要があります。 作成するには、下のボタンをクリックし、上記の値をコピーして貼り付けます。

# twitch_step2_button
source: Create Application
de_de: Applikation erstellen
ja_jp: Applicationを作成

# twitch_step3
source: Step 3: Enter Client ID
de_de: Schritt 3: Client ID eingeben
ja_jp: Step 3: クライアントIDを入力する

# twitch_step3_desc
source: After you created the application copy the <code>Client ID</code> from the website and paste it in the field below.
de_de: Nachdem du die Applikation erstellt hast musst du die <code>Client ID</code> von der Seite kopieren und in das Feld unten eingeben.
ja_jp: アプリケーションを作成したら、Webサイトから<code> Client ID </ code>をコピーして、下のフィールドに貼り付けます。

# twitch_step3_desc2
source: If you have filled in the Client ID you can click <code>Save</code>.
de_de: Wenn du die Client ID eingegeben hasst kannst du auf <code>Speichern</code> klicken.
ja_jp: クライアントIDを入力した場合は、<code>保存</ code>をクリックします。

# twitch_no_access_key
source: No access key generated. Please check the settings.
de_de: Du hast kein Access Key erstellt. Bitte überprüfe deine Einstellungen.
ja_jp: アクセスキーは生成されません。 設定を確認してください。

# twitch_loading_streams
source: Loading streamsâ€¦.
de_de: Lade Streams….
ja_jp: Loading streams….

# twitch_active_streams
source: active livestreams
de_de: aktive Livestreams
ja_jp: 現在のライブストリーム

# twitch_max_streams
source: max. amount of streams displayed
ja_jp: max. 表示されるストリームの量

# twitch_sort_by
source: sort streams by
ja_jp: ストリームを並べ替える

# twitch_sort_by_game
source: game
ja_jp: ゲーム

# twitch_sort_by_viewers
source: viewer count
ja_jp: 視聴者数

# twitch_sort_by_name
source: name
ja_jp: 名前

# twitch_reset_config
source: Reset Config
de_de: Einstellungen zurücksetzen
ja_jp: リセット設定

# twitch_save
source: Save Settings
de_de: Speichern
ja_jp: 設定を保存
